IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/UART4.xml
<module name="UART4" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="MEM_DLL" acronym="MEM_DLL" offset="0x0" width="32" description="Divisor Latches Low Register">
		<bitfield id="CLOCK_LSB" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit LSB divisor value" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_RHR" acronym="MEM_RHR" offset="0x0" width="32" description="The receiver section consists of the receiver holding register (RHR) and the receiver shift register. The RHR is actually a 64-byte FIFO. The receiver shift register receives serial data from RX input. The data is converted to parallel data and moved to the RHR. If the FIFO is disabled location zero of the FIFO is used to store the single data character. 
Note: If an overflow occurs the data in the RHR is not overwritten.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RHR" width="8" begin="7" end="0" resetval="0x0" description="Receive holding register" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_THR" acronym="MEM_THR" offset="0x0" width="32" description="The transmitter section consists of the transmit holding register (THR) and the transmit shift register. The transmit holding register is actually a 64-byte FIFO. The LH writes data to the THR. The data is placed into the transmit shift register where it is shifted out serially on the TX output. If the FIFO is disabled location zero of the FIFO is used to store the data. ">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="THR" width="8" begin="7" end="0" resetval="0x0" description="TRANSMIT HOLDING REGISTER" range="7 - 0" rwaccess="W"/>
	</register>
	<register id="MEM_DLH" acronym="MEM_DLH" offset="0x4" width="32" description="Divisor Latches High Register">
		<bitfield id="CLOCK_MSB" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit MSB divisor value" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_IER_CIR" acronym="MEM_IER_CIR" offset="0x4" width="32" description="The interrupt enable register (IER) can be programmed to enable/disable any interrupt. There are 6 types of interrupt in these modes, TX status, status FIFO interrupt, RX overrun, last byte in RX FIFO, THR interrupt and RHR interrupt and they can be enabled/disabled individually.">
		<bitfield id="NOT_USED2" width="2" begin="7" end="6" resetval="0x0" description="" range="7 - 6" rwaccess="R/W"/> 
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="NOT_USED1" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="RX_OVERRUN_IT" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="RX_STOP_IT" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="MEM_IER_IRDA" acronym="MEM_IER_IRDA" offset="0x4" width="32" description="The interrupt enable register (IER) can be programmed to enable/disable any interrupt. There are 8 types of interrupt in these modes, received EOF, LSR interrupt, TX status, status FIFO interrupt, RX overrun, last byte in RX FIFO, THR interrupt and RHR interrupt and they can be enabled/disabled individually.">
		<bitfield id="EOF_IT" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R/W"/> 
		<bitfield id="LINE_STS_IT" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/> 
		<bitfield id="TX_STATUS_IT" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="STS_FIFO_TRIG_IT" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="RX_OVERRUN_IT" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="LAST_RX_BYTE_IT" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="MEM_IER_UART" acronym="MEM_IER_UART" offset="0x4" width="32" description="The interrupt enable register (IER) can be programmed to enable/disable any interrupt. There are seven types of interrupt in this mode: receiver error, RHR interrupt, THR interrupt, XOFF received and CTS*/RTS* change of state from low to high. Each interrupt can be enabled/disabled individually. There is also a sleep mode enable bit.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="CTS_IT" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R/W"/> 
		<bitfield id="RTS_IT" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/> 
		<bitfield id="XOFF_IT" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="SLEEP_MODE" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="MODEM_STS_IT" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="LINE_STS_IT" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="THR_IT" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R/W"/> 
		<bitfield id="RHR_IT" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
