IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/UART4.xml
Note: As soon as LCR[6] is set to 1, the TX line is forced to 0 and remains in this state as long as LCR[6] = 1.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="DIV_EN" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R/W"/> 
		<bitfield id="BREAK_EN" width="1" begin="6" end="6" resetval="0x0" description="Break control bit." range="6" rwaccess="R/W"/> 
		<bitfield id="PARITY_TYPE2" width="1" begin="5" end="5" resetval="0x0" description="Selects the forced parity format [if LCR[3] = 1]. If LCR[5] = 1 and LCR[4] = 0, the parity bit is forced to 1 in the transmitted and received data. If LCR[5] = 1 and LCR[4] = 1, the parity bit is forced to 0 in the transmitted and received data." range="5" rwaccess="R/W"/> 
		<bitfield id="PARITY_TYPE1" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="PARITY_EN" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="NB_STOP" width="1" begin="2" end="2" resetval="0x0" description="Specifies the number of stop bits:" range="2" rwaccess="R/W"/> 
		<bitfield id="CHAR_LENGTH" width="2" begin="1" end="0" resetval="0x0" description="Specifies the word length to be transmitted or received." range="1 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_MCR" acronym="MEM_MCR" offset="0x10" width="32" description="MCR[3:0] controls the interface with the modem, data set or peripheral device that is emulating the modem. ">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/> 
		<bitfield id="TCR_TLR" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R/W"/> 
		<bitfield id="XON_EN" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R/W"/> 
		<bitfield id="LOOPBACK_EN" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R/W"/> 
		<bitfield id="CD_STS_CH" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R/W"/> 
		<bitfield id="RI_STS_CH" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R/W"/> 
		<bitfield id="RTS" width="1" begin="1" end="1" resetval="0x0" description="In loop back controls MSR[4].  If auto-RTS is enabled the RTS* output is controlled by hardware flow control." range="1" rwaccess="R/W"/> 
		<bitfield id="DTR" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R/W"/>
	</register>
	<register id="MEM_XON1_ADDR1" acronym="MEM_XON1_ADDR1" offset="0x10" width="32" description="XON1/ADDR1 Register">
		<bitfield id="XON_WORD1" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON1 character in UART modes and ADDR1 address 1 for IrDA modes." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_LSR_CIR" acronym="MEM_LSR_CIR" offset="0x14" width="32" description="">
		<bitfield id="THR_EMPTY" width="1" begin="7" end="7" resetval="0x1" description="" range="7" rwaccess="R"/> 
		<bitfield id="RESERVED" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R"/> 
		<bitfield id="RX_STOP" width="1" begin="5" end="5" resetval="0x0" description="The RX_STOP is generated based on the value set in the BOF Length register (EBLR). It is cleared on a single read of the LSR register" range="5" rwaccess="R"/> 
		<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_LSR_IRDA" acronym="MEM_LSR_IRDA" offset="0x14" width="32" description="">
		<bitfield id="THR_EMPTY" width="1" begin="7" end="7" resetval="0x1" description="" range="7" rwaccess="R"/> 
		<bitfield id="STS_FIFO_FULL" width="1" begin="6" end="6" resetval="0x0" description="" range="6" rwaccess="R"/> 
		<bitfield id="RX_LAST_BYTE" width="1" begin="5" end="5" resetval="0x0" description="" range="5" rwaccess="R"/> 
		<bitfield id="FRAME_TOO_LONG" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R"/> 
		<bitfield id="ABORT" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R"/> 
		<bitfield id="CRC" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R"/> 
		<bitfield id="STS_FIFO_E" width="1" begin="1" end="1" resetval="0x1" description="" range="1" rwaccess="R"/> 
		<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x1" description="" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_LSR_UART" acronym="MEM_LSR_UART" offset="0x14" width="32" description="">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="RX_FIFO_STS" width="1" begin="7" end="7" resetval="0x0" description="" range="7" rwaccess="R"/> 
		<bitfield id="TX_SR_E" width="1" begin="6" end="6" resetval="0x1" description="" range="6" rwaccess="R"/> 
		<bitfield id="TX_FIFO_E" width="1" begin="5" end="5" resetval="0x1" description="" range="5" rwaccess="R"/> 
		<bitfield id="RX_BI" width="1" begin="4" end="4" resetval="0x0" description="" range="4" rwaccess="R"/> 
		<bitfield id="RX_FE" width="1" begin="3" end="3" resetval="0x0" description="" range="3" rwaccess="R"/> 
		<bitfield id="RX_PE" width="1" begin="2" end="2" resetval="0x0" description="" range="2" rwaccess="R"/> 
		<bitfield id="RX_OE" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R"/> 
		<bitfield id="RX_FIFO_E" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_XON2_ADDR2" acronym="MEM_XON2_ADDR2" offset="0x14" width="32" description="XON2/ADDR2 Register">
		<bitfield id="XON_WORD2" width="8" begin="7" end="0" resetval="0x0" description="Used to store the 8-bit XON2 character in UART modes and ADDR2 address 2 for IrDA modes." range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_MSR" acronym="MEM_MSR" offset="0x18" width="32" description="This register provides information about the current state of the control lines from the modem, data set or peripheral device to the LH. It also indicates when a control input from the modem changes state.">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="NCD_STS" width="1" begin="7" end="7" resetval="0x0" description="This bit is the complement of the DCD* input. In loop-back mode it is equivalent to MCR[3] " range="7" rwaccess="R"/> 
		<bitfield id="NRI_STS" width="1" begin="6" end="6" resetval="0x0" description="This bit is the complement of the RI* input. In loop-back mode it is equivalent to MCR[2]" range="6" rwaccess="R"/> 
		<bitfield id="NDSR_STS" width="1" begin="5" end="5" resetval="0x0" description="This bit is the complement of the DSR* input. In loop-back mode, it is equivalent to MCR[0]" range="5" rwaccess="R"/> 
		<bitfield id="NCTS_STS" width="1" begin="4" end="4" resetval="0x0" description="This bit is the complement of the CTS* input. In loop-back mode it is equivalent to MCR[1]" range="4" rwaccess="R"/> 
		<bitfield id="DCD_STS" width="1" begin="3" end="3" resetval="0x0" description="Indicates that DCD* input [or MCR[3] in loop back] has changed. Cleared on a read." range="3" rwaccess="R"/> 
		<bitfield id="RI_STS" width="1" begin="2" end="2" resetval="0x0" description="Indicates that RI* input [or MCR[2] in loop back] has changed state from low to high. Cleared on a read." range="2" rwaccess="R"/> 
		<bitfield id="DSR_STS" width="1" begin="1" end="1" resetval="0x0" description="" range="1" rwaccess="R"/> 
		<bitfield id="CTS_STS" width="1" begin="0" end="0" resetval="0x0" description="" range="0" rwaccess="R"/>
	</register>
	<register id="MEM_TCR" acronym="MEM_TCR" offset="0x18" width="32" description="Transmission Control Register">
		<bitfield id="RX_FIFO_TRIG_START" width="4" begin="7" end="4" resetval="0x0" description="RX FIFO trigger level to RESTORE transmission (0 - 60)" range="7 - 4" rwaccess="R/W"/> 
		<bitfield id="RX_FIFO_TRIG_HALT" width="4" begin="3" end="0" resetval="0x15" description="RX FIFO trigger level to HALT transmission (0 - 60)" range="3 - 0" rwaccess="R/W"/>
	</register>
