IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/UART4.xml
	<register id="MEM_TIMEGUARD" acronym="MEM_TIMEGUARD" offset="0x94" width="32" description="Timeguard">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="TIMEGUARD" width="8" begin="7" end="0" resetval="0x0" description="Specifies the amount of idle baud clocks [transmitter bit period] to  insert between  transmitted bytes, useful when comunicating with slower devices" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_TIMEOUTL" acronym="MEM_TIMEOUTL" offset="0x98" width="32" description="Timeout lower byte">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="TIMEOUT_L" width="8" begin="7" end="0" resetval="0x0" description="Custom timeout period in baud clocks, to override the internal value, when different from 0. [Lower byte of the 16 bit value]" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_TIMEOUTH" acronym="MEM_TIMEOUTH" offset="0x9C" width="32" description="Timeout higher byte">
		<bitfield id="RESERVED" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="TIMEOUT_H" width="8" begin="7" end="0" resetval="0x0" description="Custom timeout period in baud clocks, to override the internal value, when different from 0. [Higher byte of the 16 bit value]" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_SCCR" acronym="MEM_SCCR" offset="0xA0" width="32" description="Smartcard (ISO7816) mode Control Register">
		<bitfield id="RESERVED1" width="24" begin="31" end="8" resetval="0x0" description="" range="31 - 8" rwaccess="R"/> 
		<bitfield id="DSNACK" width="1" begin="7" end="7" resetval="0x0" description="Applies Max_Iteration to receiver aswell - when maximum number of NACKs  have been returned, the receiver will accept the data regardless of error. The data will be loaded into the receiver FIFO and PE will be set when reading it." range="7" rwaccess="R/W"/> 
		<bitfield id="INACK" width="1" begin="6" end="6" resetval="0x0" description="Inhibit NACK when receiving, even if an error is received. The data will be loaded into the receiver FIFO and PE will be set when reading it." range="6" rwaccess="R/W"/> 
		<bitfield id="RESERVED" width="3" begin="5" end="3" resetval="0x0" description="" range="5 - 3" rwaccess="R"/> 
		<bitfield id="MAX_ITERATION" width="3" begin="2" end="0" resetval="0x7" description="Number of times to repeat transmitted character, if the receiver did not acknowledge. If not acknowledged after the max value is reached, the USART transmitter will set parity error, stop and not continue until it is cleared." range="2 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_ERHR" acronym="MEM_ERHR" offset="0xA4" width="32" description="Extended Receive Holding Register">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="" range="31 - 9" rwaccess="R"/> 
		<bitfield id="ERHR" width="9" begin="8" end="0" resetval="0x0" description="Extended Receive Holding Register - allows accessing the full 9bit RHR" range="8 - 0" rwaccess="R"/>
	</register>
	<register id="MEM_ETHR" acronym="MEM_ETHR" offset="0xA4" width="32" description="Extended Transmit Holding Register">
		<bitfield id="RESERVED" width="23" begin="31" end="9" resetval="0x0" description="" range="31 - 9" rwaccess="R"/> 
		<bitfield id="ETHR" width="9" begin="8" end="0" resetval="0x0" description="Extended Transmit Holding Register - allows writing the full 9bit RHR" range="8 - 0" rwaccess="W"/>
	</register>
	<register id="MEM_MAR" acronym="MEM_MAR" offset="0xA8" width="32" description="Multidrop Address Register">
		<bitfield id="ADDRESS" width="8" begin="7" end="0" resetval="0x0" description="Multidrop match address value" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_MMR" acronym="MEM_MMR" offset="0xAC" width="32" description="Multidrop Mask Register">
		<bitfield id="MASK" width="8" begin="7" end="0" resetval="0x0" description="Address match masking value ? writing a 0 to a bit means that the corresponding address bit will be ignored in matching" range="7 - 0" rwaccess="R/W"/>
	</register>
	<register id="MEM_MBR" acronym="MEM_MBR" offset="0xB0" width="32" description="Multidrop Broadcast Address Register">
		<bitfield id="BROADCAST_ADDRESS" width="8" begin="7" end="0" resetval="0x0" description="Broadcast address for address matching" range="7 - 0" rwaccess="R/W"/>
	</register>
</module>